# -*- coding: utf-8 -*-
import simple_draw as sd
from picture.tree import drawing_tree
from picture.home import draw_wall
from picture.rainbow import draw_rainbow
from picture.smile import draw_smile
from picture.snow import snowfall
sd.resolution = (1200, 700)
sd.start_drawing()

drawing_tree(point=sd.get_point(1020, 5), angle=90, length=70, color=sd.COLOR_DARK_ORANGE, width=4)
draw_wall()
draw_rainbow(1050, -600, 1600, 12)
draw_smile(350, 220, 50)
snowfall(10)


sd.finish_drawing()
sd.pause()




# Создать пакет, в который скопировать функции отрисовки из предыдущего урока
#  - радуги
#  - стены
#  - дерева
#  - смайлика
#  - снежинок
# Функции по модулям разместить по тематике. Название пакета и модулей - по смыслу.
# Создать модуль с функцией отрисовки кирпичного дома с широким окном и крышей.

# С помощью созданного пакета нарисовать эпохальное полотно "Утро в деревне".
# На картине должны быть:
#  - кирпичный дом, в окошке - смайлик.
#  - слева от дома - сугроб (предположим что это ранняя весна)
#  - справа от дома - дерево (можно несколько)
#  - справа в небе - радуга, слева - солнце (весна же!)
# пример см. lesson_005/results/04_painting.jpg
# Приправить своей фантазией по вкусу (коты? коровы? люди? трактор? что придумается)

# TODO здесь ваш код

# Усложненное задание (делать по желанию)
# Анимировать картину.
# Пусть слева идет снегопад, радуга переливается цветами, смайлик моргает, солнце крутит лучами, етс.
# Задержку в анимировании все равно надо ставить, пусть даже 0.01 сек - так библиотека устойчивей работает.
